""" 定义变量，python中没有声明关键字，直接赋值即可  没有常量声明   变量命名：xXXXXX  a_b_c """

i = 10  # 整数类型  函数请求查看math API
f = 3.1445465465  # 浮点数类型
s = "我是中国人，你好啊！！！"  # 字符串类型 多行字符串类型''''''
b = True  # 布尔类型
x,y=1000,1190 # 元组类型

 #global x  # 声明 x 为全局变量



# 格式化输出  # %i表示整数类型，%f表示浮点数类型，%s表示字符串类型，
print("整数类型%i" "浮点数类型%.2f" "字符串类型%s" % (i, f, s))
# 格式化输出 sep="逗号的间隔符" end="输出结束符"
print("格式化输出 sep='逗号的间隔符' end='输出结束符':", i, f, s, b, sep="*", end="\n")


print("获取变量类型:", type(i), type(f), type(s), type(b))
print("字符串索引长度:", len(s))
print("获取指定索引字符串:", s[2])
print("获取多个指定索引字符串:", s[2:7])
print("获取多个指定索引字符串步长为2:", s[0:len(s):2]) # 从0开始，步长为2
print("字符串反转:", s[::-1])
